certora-z0ld/mutations/participants_roleStore/bug1.patch
diff --git a/contracts/role/RoleStore.sol b/contracts/role/RoleStore.sol
index 5868ccc..75f299e 100644
--- a/contracts/role/RoleStore.sol
+++ b/contracts/role/RoleStore.sol
@@ -115,6 +115,7 @@ contract RoleStore {
     }
 
     function _revokeRole(address account, bytes32 roleKey) internal {
+        roles.remove(roleKey);
         roleMembers[roleKey].remove(account);
         roleCache[account][roleKey] = false;
 
