certora-z0ld/mutations/participants_roleStore/bug16.patch
diff --git a/contracts/role/RoleStore.sol b/contracts/role/RoleStore.sol
index 5868ccc..d64d67d 100644
--- a/contracts/role/RoleStore.sol
+++ b/contracts/role/RoleStore.sol
@@ -111,7 +111,7 @@ contract RoleStore {
     function _grantRole(address account, bytes32 roleKey) internal {
         roles.add(roleKey);
         roleMembers[roleKey].add(account);
-        roleCache[account][roleKey] = true;
+        //roleCache[account][roleKey] = true;
     }
 
     function _revokeRole(address account, bytes32 roleKey) internal {
