certora-z0ld/mutations/participants_roleStore/bug2.patch
diff --git a/contracts/role/RoleStore.sol b/contracts/role/RoleStore.sol
index 5868ccc..2d13218 100644
--- a/contracts/role/RoleStore.sol
+++ b/contracts/role/RoleStore.sol
@@ -109,7 +109,7 @@ contract RoleStore {
     }
 
     function _grantRole(address account, bytes32 roleKey) internal {
-        roles.add(roleKey);
+        //roles.add(roleKey);
         roleMembers[roleKey].add(account);
         roleCache[account][roleKey] = true;
     }
