certora-z0ld/mutations/participants_roleStore/bug4.patch
diff --git a/contracts/role/RoleStore.sol b/contracts/role/RoleStore.sol
index 5868ccc..a94da46 100644
--- a/contracts/role/RoleStore.sol
+++ b/contracts/role/RoleStore.sol
@@ -41,7 +41,7 @@ contract RoleStore {
      * @param account The address of the account.
      * @param roleKey The key of the role to grant.
      */
-    function grantRole(address account, bytes32 roleKey) external onlyRoleAdmin {
+    function grantRole(address account, bytes32 roleKey) external {
         _grantRole(account, roleKey);
     }
 
