certora-z0ld/mutations/participants_roleStore/bug6.patch
diff --git a/contracts/role/RoleStore.sol b/contracts/role/RoleStore.sol
index 5868ccc..262fead 100644
--- a/contracts/role/RoleStore.sol
+++ b/contracts/role/RoleStore.sol
@@ -118,7 +118,7 @@ contract RoleStore {
         roleMembers[roleKey].remove(account);
         roleCache[account][roleKey] = false;
 
-        if (roleMembers[roleKey].length() == 0) {
+        if (roleMembers[roleKey].length() != 0) {
             if (roleKey == Role.ROLE_ADMIN) {
                 revert Errors.ThereMustBeAtLeastOneRoleAdmin();
             }
