certora-z0ld/mutations/participants_roleStore/bug7.patch
diff --git a/contracts/role/RoleStore.sol b/contracts/role/RoleStore.sol
index 5868ccc..8369005 100644
--- a/contracts/role/RoleStore.sol
+++ b/contracts/role/RoleStore.sol
@@ -122,7 +122,7 @@ contract RoleStore {
             if (roleKey == Role.ROLE_ADMIN) {
                 revert Errors.ThereMustBeAtLeastOneRoleAdmin();
             }
-            if (roleKey == Role.TIMELOCK_MULTISIG) {
+            if (roleKey != Role.TIMELOCK_MULTISIG) {
                 revert Errors.ThereMustBeAtLeastOneTimelockMultiSig();
             }
         }
