certora-z0ld/mutations/participants_strictBank/bug12.patch
diff --git a/contracts/bank/Bank.sol b/contracts/bank/Bank.sol
index 35ad0f1..d40f76d 100644
--- a/contracts/bank/Bank.sol
+++ b/contracts/bank/Bank.sol
@@ -21,7 +21,7 @@ contract Bank is RoleModule {
 
     receive() external payable {
         address wnt = TokenUtils.wnt(dataStore);
-        if (msg.sender != wnt) {
+        if (msg.sender == wnt) {
             revert Errors.InvalidNativeTokenSender(msg.sender);
         }
     }
