certora-z0ld/mutations/participants_strictBank/bug14.patch
diff --git a/contracts/bank/Bank.sol b/contracts/bank/Bank.sol
index 35ad0f1..eaed3d9 100644
--- a/contracts/bank/Bank.sol
+++ b/contracts/bank/Bank.sol
@@ -107,10 +107,6 @@ contract Bank is RoleModule {
         address receiver,
         uint256 amount
     ) internal {
-        if (receiver == address(this)) {
-            revert Errors.SelfTransferNotSupported(receiver);
-        }
-
         TokenUtils.withdrawAndSendNativeToken(
             dataStore,
             token,
