certora-z0ld/mutations/participants_strictBank/bug17.patch
diff --git a/contracts/bank/Bank.sol b/contracts/bank/Bank.sol
index 35ad0f1..5d2a941 100644
--- a/contracts/bank/Bank.sol
+++ b/contracts/bank/Bank.sol
@@ -91,7 +91,7 @@ contract Bank is RoleModule {
             revert Errors.SelfTransferNotSupported(receiver);
         }
 
-        TokenUtils.transfer(dataStore, token, receiver, amount);
+        //TokenUtils.transfer(dataStore, token, receiver, amount);
 
         _afterTransferOut(token);
     }
