certora-z0ld/mutations/participants_strictBank/bug19.patch
diff --git a/contracts/bank/StrictBank.sol b/contracts/bank/StrictBank.sol
index 49a8e6b..576ace8 100644
--- a/contracts/bank/StrictBank.sol
+++ b/contracts/bank/StrictBank.sol
@@ -42,7 +42,7 @@ contract StrictBank is Bank {
     function syncTokenBalance(address token) external onlyController returns (uint256) {
         uint256 nextBalance = IERC20(token).balanceOf(address(this));
         tokenBalances[token] = nextBalance;
-        return nextBalance;
+        return 0;
     }
 
     // @dev records a token transfer into the contract
